Revit 2027 API
IFCExtrusionCreationData.HasCustomAxis Property
 Identifies if the data contains a custom extrusion axis.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasCustomAxis { get; }
Public ReadOnly Property HasCustomAxis As Boolean
	Get
public:
property bool HasCustomAxis {
	bool get ();
}
member HasCustomAxis : bool with get
Property Value
Boolean
See Also
Reference
IFCExtrusionCreationData Class
Autodesk.Revit.DB.IFC Namespace